<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Acerca de</title>
    <link rel="stylesheet" href="css/Acerca_de.css">
</head>

<body>
    <header>
        <a href="index.html" id="logo">
            <p id="mate">Mate<span id="web">Web</span></p>
            </a>
        <div class="cantainer__menu">
            <div class="menu">
                <nav>
                    <ul>
                        <li><a href="index.html">Inicio</a></li>
                        <li><a href="operaciones_basicas.html">Operaciones b&aacute;sicas</a></li>
                        <li><a href="Ejercicios_y_practicas.html">Ejercicios y pr&aacute;cticas</a></li>
                        <li><a href="Quiz.html">Ejercicios y pr&aacute;cticas</a></li>
                        <li><a href="Acerca_de.html">Acerca de</a></li>
                    </ul>
                </nav>
            </div>
        </div>
        <section class="textos-header">
            <h1>Acerca de</h1>
            <h2>"Conócenos y Descubre el Mundo de las matem&aacute;ticas"</h2>
        </section>
        <div class="wave" style="height: 150px; overflow: hidden;"><svg viewBox="0 0 500 150" preserveAspectRatio="none"
                style="height: 100%; width: 100%;">
                <path d="M0.00,49.98 C150.00,150.00 349.20,-50.00 500.00,49.98 L500.00,150.00 L0.00,150.00 Z"
                    style="stroke: none; fill: #fff;"></path>
            </svg></div>
    </header>
    <article>
        <main>
            <section class="contenedor sobre-nosotros">
                <h2 class="titulo">¡Binvenidos!</h2>
                <div class="contenedor-sobre-nosotros">
                    <img src="img/ilustracion2.svg" alt="" class="imagen-about-us">
                    <div class="contenido-textos">
                        <h3>Descripci&oacute;n de bienvenida</h3>
                        <p>Bienvenido a nuestra plataforma de aprendizaje en l&iacute;nea, donde las matem&aacute;ticas
                             se vuelven emocionantes. Aqu&iacute;, compartimos nuestra pasi&oacute;n por la 
                             educación matem&aacute;tica. Nuestra plataforma est&aacute; diseñada para hacer que las
                              matem&aacute;ticas sean accesibles, comprensibles y atractivas.</p>

                            <p>Reconocemos que las matem&aacute;ticas pueden ser un desaf&iacute;o,
                                 y nuestra misi&oacute;n es explicarlas. Desde los conceptos 
                                 b&aacute;sicos hasta los desaf&iacute;os avanzados, te acompa&ntilde;amos en tu viaje de aprendizaje.</p>
                            
                           <p> Lo que nos diferencia es nuestro enfoque en hacer que las matem&aacute;ticas
                             sean emocionantes y atractivas. Cada lecci&oacute;n y ejercicio est&aacute;n dise&ntilde;ados
                              para inspirarte y hacer que las mate&aacute;ticas sean una aventura intelectual.</p>
        
                    </div>
                </div>
            </section>
        </article>
        <main>
            <section class="about-services">
                <div class="contenedor">
                    <h2 class="titulo">Acerca de Nsotros</h2>
                    <div class="servicio-cont">
                        <div class="servicio-ind">
                            <img src="img/ilustracion5.svg" alt="">
                            <h3>¿Qui&eacute;nes somos?</h3>
                            <p>En MateWeb, nos dedicamos apasionadamente a simplificar 
                                las operaciones b&aacute;sicas y promover su comprensi&oacute;n. Creemos en la importancia
                                 de estas operaciones como cimientos fundamentales de las matem&aacute;ticas y su
                                  relevancia en la vida diaria. Nuestro compromiso radica en facilitar el
                                   aprendizaje y proporcionar recursos interactivos que hagan que las
                                    matem&aacute;ticas sean accesibles para personas de todas las edades y
                                     niveles de experiencia.</p>
                        </div>
                        <div class="servicio-ind">
                            <img src="img/ilustracion4.svg" alt="">
                            <h3>Nuestra Misi&oacute;n</h3>
                            <p>En MateWeb, nos esforzamos por hacer que las matem&aacute;ticas
                                 y las operaciones cotidianas sean accesibles para todos, sin importar su 
                                 nivel de experiencia. Buscamos convertirnos en la fuente de confianza para
                                  aprender y comprender las operaciones b&aacute;sicas, con el objetivo de 
                                  empoderar a las personas, brind&aacute;ndoles 
                                  las herramientas y recursos necesarios para dominar las matem&aacute;ticas
                                   fundamentales. Estamos comprometidos en hacer que las matem&aacute;ticas
                                    sean comprensibles y asequibles, sin importar qui&eacute;nes sean nuestros usuarios.</p>
                        </div>
                        <div class="servicio-ind">
                            <img src="img/ilustracion3.svg" alt="">
                            <h3>Nuestra Visi&oacute;n</h3>
                            <p>En MateWeb, buscamos convertirnos
                                 en el referente confiable para el aprendizaje y comprensi&oacute;n 
                                 de las operaciones b&aacute;sicas. Nuestra visi&oacute;n es inspirar a
                                  individuos de diversos or&iacute;genes y edades, proporcion&aacute;ndoles
                                   las herramientas y recursos esenciales para dominar las
                                    matem&aacute;ticas fundamentales. Deseamos ser la fuente que gu&iacute;a
                                     a quienes buscan fortalecer sus habilidades matem&aacute;ticas
                                      y desean explorar un mundo de posibilidades a trav&eacute;s del 
                                      conocimiento matem&aacute;tico.</p>
                        </div>
                    </div>
                </div>
            </section>
        </main>
        <main>
            <section class="contenedor sobre-nosotros">
                <h2 class="titulo">Nuestro Compromiso:</h2>
                <div class="contenedor-sobre-nosotros">
                    <img src="img/img14.jpg" class="imagen-about-us">
                    <div class="contenido-textos">
                        <h3>En MateWeb, nos comprometemos a:</h3>
                        <p><strong><span>1</span></strong>Proporcionar contenido educativo de alta calidad 
                            y f&aacute;cil de entender sobre operaciones b&aacute;sicas.</p>
                           <p><strong><span>2</span></strong>Ofrecer recursos interactivos y ejercicios pr&aacute;cticos
                             para mejorar las habilidades matem&aacute;ticas.</p>
                            <p><strong><span>3</span></strong>Fomentar un entorno de aprendizaje seguro y alentador para todos
                                 nuestros usuarios.</p>
                            <p><strong><span>4</span></strong>Adaptar nuestros recursos y materiales para satisfacer las 
                                necesidades individuales de los estudiantes, incluyendo aquellos con diferentes estilos de aprendizaje.</p>
                        </div>
                </div>
            </section>
        </main>
            <main>
                <section class="contenedor sobre-nosotros">
                    <h2 class="titulo">Nuestros Valores</h2>
                    <div class="contenedor-sobre-nosotros">
                        <img src="img/img15.png" alt="" class="imagen-about-us">
                        <div class="contenido-textos">
                            <h3><span>1</span>Precisi&oacute;n Matem&aacute;tica:</h3>
                            <p>Valoramos la exactitud en las operaciones matem&aacute;ticas, asegurando 
                                que nuestros c&aacute;lculos sean correctos y confiables.</p>
                            <h3><span>2</span>Metodolog&iacute;a Rigurosa:</h3>
                            <p>Seguimos procedimientos y pasos precisos en nuestras operaciones 
                                matem&aacute;ticas para garantizar resultados consistentes.</p>
                            <h3><span>3</span>Eficiencia Num&eacute;rica:</h3>
                                <p> Buscamos la eficiencia en el manejo de n&uacute;meros, optimizando nuestros 
                                    c&aacute;lculos para lograr soluciones r&aacute;pidas y efectivas.</p>
                            <h3><span>4</span>Claridad en la Explicaci&oacute;n:</h3>
                                    <p>Nos esforzamos por comunicar de manera clara y comprensible 
                                        los conceptos matem&aacute;ticos, para que sean accesibles a todos.</p>
                            <h3><span>5</span>Aprendizaje Continuo:</h3>
                            <p>Valoramos la mejora constante en nuestras habilidades matem&aacute;ticas, 
                                siempre en busca de adquirir nuevos conocimientos.

                            </p>
                        </div>
                    </div>
                </section>
            </article>
        </main>
        <footer>
            <div class="contenedor-footer">
                <div class="content-foo">
                    <h4>Telefono</h4>
                    <p>+57 3113023752</p>
                </div>
                <div class="content-foo">
                    <h4>Gmail</h4>
                    <p>sebastian.mahecha8a2020@jfkennedy.edu.co</p>
                </div>
                <div class="content-foo">
                    <h4>Ubicaci&oacute;n</h4>
                    <p>Puerto Boyac&aacute;, Boyac&aacute;, Colombia</p>
                </div>
            </div>
            <h2 class="titulo-final">&copy; MateWeb | Sebastian Mahecha</h2>
        </footer>
        </article>
    
        <script src="css/js/script.js"></script>
    </body>
    
    </html>