<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Operaciones b&aacute;sicas</title>
    <link rel="stylesheet" href="css/operaciones_basicas.css">
</head>

<body>
    <header>
        <a href="index.html" id="logo">
            <p id="mate">Mate<span id="web">Web</span></p>
            </a>
        <div class="cantainer__menu">
            <div class="menu">
                <nav>
                    <ul>
                        <li><a href="index.html">Inicio</a></li>
                        <li><a href="operaciones_basicas.html">Operaciones b&aacute;sicas</a></li>
                        <li><a href="Ejercicios_y_practicas.html">Ejercicios y pr&aacute;cticas</a></li>
                        <li><a href="Quiz.html">Quiz</a></li>
                        <li><a href="Acerca_de.html">Acerca de</a></li>
                    </ul>
                </nav>
            </div>
        </div>
        <section class="textos-header">
            <h1>Operaciones B&aacute;sicas</h1>
            <h2>"¡La Fórmula de tu Éxito!"</h2>
        </section>
        <div class="wave" style="height: 150px; overflow: hidden;"><svg viewBox="0 0 500 150" preserveAspectRatio="none"
                style="height: 100%; width: 100%;">
                <path d="M0.00,49.98 C150.00,150.00 349.20,-50.00 500.00,49.98 L500.00,150.00 L0.00,150.00 Z"
                    style="stroke: none; fill: #fff;"></path>
            </svg></div>
    </header>
    <article>
        <main>
            <section class="contenedor sobre-nosotros">
                <h2 class="titulo">Operaciones b&aacute;sicas: fundamentos escenciales de matem&aacute;ticas</h2>
                <div class="contenedor-sobre-nosotros">
                    <img src="img/img9.png" alt="" class="imagen-about-us">
                    <div class="contenido-textos">
                        <h3>Definici&oacute;n</h3>
                        <p>Las operaciones b&aacute;sicas, un pilar fundamental en 
                            el mundo de las matem&aacute;ticas, son herramientas 
                            esenciales que nos permiten comprender y resolver
                             problemas en diversas áreas de la vida. Estas operaciones, 
                             que consisten en la suma, resta, multiplicaci&oacute;n y divisi&oacute;n, 
                             no solo son conceptos matem&aacute;ticos clave, sino tambi&eacute;n cimientos
                              sobre los que se forman habilidades matem&aacute;ticas m&aacute;s avanzadas.
                               La suma nos permite combinar n&uacute;meros, la resta determina 
                               diferencias, la multiplicaci&oacute;n implica repeticiones y la divisi&oacute;n 
                               nos ayuda a distribuir de manera equitativa. En este apartado, 
                               exploraremos a fondo estos conceptos, sus propiedades y 
                               aplicaciones en contextos pr&aacute;cticos, proporcionando una base
                                s&oacute;lida para abordar desaf&iacute;os matem&aacute;ticos y resolver problemas
                                 cotidianos. Al comprender y dominar estas operaciones, 
                                 no solo mejoramos nuestras habilidades matem&aacute;ticas,
                                  sino que tambi&eacute;n fortalecemos nuestra capacidad para 
                                  tomar decisiones informadas, enfrentar desaf&iacute;os en campos 
                                  como la ciencia, la ingenier&iacute;a, la econom&iacute;a y la 
                                  inform&aacute;tica, y mejorar nuestra calidad de vida en general.</p>
                        
                    </div>
                </div>
            </section>
            </main>
        </article>
            <article>
                <main>
                    <section class="contenedor sobre-nosotros">
                        <h2 class="titulo">Suma: La Operación Fundamental</h2>
                        <div class="contenedor-sobre-nosotros">
                            <img src="img/img10.png" alt="" class="imagen-about-us">
                            <div class="contenido-textos">
                                <h3>Definici&oacute;n</h3>
                                <p>La suma, en matem&aacute;ticas, es una operaci&oacute;n fundamental que involucra 
                                    la combinaci&oacute;n de dos o m&aacute;s n&uacute;meros para obtener un valor total.
                                     Es un proceso de agregaci&oacute;n esencial para resolver problemas y
                                      calcular totales. La propiedad conmutativa de la suma significa 
                                      que el orden de los números no afecta el resultado; 
                                      por ejemplo, 3 + 5 es igual a 5 + 3, ambos igual a 8.
                                       Además, la suma es asociativa, lo que implica que cuando 
                                       se suman tres o más números, el resultado es el mismo 
                                       sin importar cómo se agrupen. Comprender la suma es crucial,
                                        ya que sienta las bases para operaciones matem&aacute;ticas 
                                        m&aacute;s avanzadas y su aplicaci&aacute;n en diversas situaciones de la vida diaria.
                                          A continuaci&oacute;n, explicaremos algunos conceptos clave relacionados con la suma.</p>                          
                            </div>
                        </div>
                    </section>
                </article>
                <article>
                <section class="contenedor sobre-nosotros">
                    <div class="contenedor-textos">
                        <h3><span>1</span>Sumandos:</h3>
                        <p class="justificado"> Los n&uacute;meros que se suman se llaman "sumandos". Por ejemplo, en la suma 3 + 4, 3 y 4 son los sumandos. 
                            Los sumandos son los n&uacute;meros o t&eacute;rminos que se suman para obtener 
                            un total en una operac&oacute;n de suma. Son componentes clave en matem&aacute;ticas
                             y permiten representar valores en diversas situaciones, desde c&aacute;lculos 
                             simples hasta problemas m&aacute;s complejos. Comprender los sumandos es fundamental para dominar la suma.</p>
                             <h3><span>2</span>Suma:</h3>
                             <p class="justificado">El resultado de la operaci&oacute;n de suma se llama "suma" o "total".
                              En el ejemplo anterior, la suma es 7. La suma es una operaci&oacute;n fundamental 
                              que implica la adici&oacute;n de n&uacute;meros, y su comprensi&oacute;n es esencial en matem&aacute;ticas 
                              y la vida cotidiana.</p>
                              <h3><span>3</span>Propiedad Conmutativa:</h3>
                              <p class="justificado">La suma es conmutativa, lo que significa que el orden de los sumandos
                                 no afecta el resultado. En otras palabras, 3 + 4 es igual a 4 + 3, y 
                                 ambos dan como resultado 7.</p>
                        </div>
                </section>
                <main>
            </article>
            <article>
                <main>
                    <section class="clientes contenedor">
                        <h2 class="titulo">Juego de suma</h2>
                        <div class="container-juego">
                            <div class="izquierdo-suma">
                                <div id="pregunta-suma">5 + 3 =</div>
                                <input id="respuestaInput-suma" type="number" placeholder="Tu respuesta">
                                <button id="checkAnswer-suma" onclick="comprobarRespuestaSuma()">Comprobar</button>
                                <div id="resultado-suma" data-resultado="8"></div>
                                <button id="nextButton-suma" onclick="cargarNuevaPreguntaSuma()">Siguiente pregunta</button>
                                <div id="mensaje-suma"></div>
                            </div>
                        </div>
                    </section>
                </main>
            </article>
    </main>
                  
            <article>
                <main>
                    <section class="contenedor sobre-nosotros">
                        <h2 class="titulo">Resta: Complemento de la Suma</h2>
                        <div class="contenedor-sobre-nosotros">
                            <img src="img/img11.jpg" alt="" class="imagen-about-us">
                            <div class="contenido-textos">
                                <h3>Definici&oacute;n</h3>
                                <p>La resta, como la operaci&oacute;n inversa de la suma, desempe&ntilde;a un papel fundamental
                                     en las matem&aacute;ticas y la resoluci&oacute;n de problemas cotidianos. Su prop&oacute;sito 
                                     principal es encontrar la diferencia entre dos n&uacute;meros. En una operaci&oacute;n
                                      de resta, el n&uacute;mero del que se resta se llama "minuendo", el n&uacute;mero que
                                       se resta se llama "sustraendo", y el resultado se denomina "diferencia". 
                                       Por ejemplo, en la resta 7 - 3, 7 es el minuendo, 3 es el sustraendo y la
                                        diferencia es 4. A diferencia de la suma, la resta no es conmutativa ni 
                                        asociativa, lo que significa que el orden de los n&uacute;meros en la resta importa. 
                                        La resta se utiliza ampliamente en situaciones que implican comparar cantidades, 
                                        calcular cambios, determinar saldos y mucho m&aacute;s, convirti&eacute;ndola en una herramienta 
                                        esencial para la toma de decisiones informadas en &aacute;reas que van desde las finanzas
                                         hasta la ciencia y la ingenier&iacute;a. Comprender y dominar la resta es crucial para 
                                         fortalecer las habilidades matem&aacute;ticas y la resoluci&oacute;n de problemas en la vida 
                                         diaria y en contextos m&aacute;s avanzados.</p>                          
                            </div>
                        </div>
                    </section>
                </article>
            <article>
                <section class="contenedor sobre-nosotros">
                    <div class="contenedor-textos">
                        <h3><span>1</span>Minuendo, Sustraendo y Diferencia:</h3>
                        <p class="justificado">En una operaci&oacute;n de resta, el n&uacute;mero del que se resta se llama 
                            "minuendo", el n&uacute;mero que se resta se llama "sustraendo", y 
                            el resultado se llama "diferencia". Por ejemplo, en la resta
                             7 - 3, 7 es el minuendo, 3 es el sustraendo y la diferencia es 4 
                             por que 7 - 3 da como resultado 4</p>
                             <h3><span>2</span>ropiedad Asociativa:</h3>
                             <p class="justificado">La propiedad asociativa en matem&aacute;ticas, que implica que el orden 
                                de los n&uacute;meros no afecta el resultado de una operaci&oacute;n, no 
                                se aplica a la resta. Por ejemplo, 7 - 3 no es igual a 3 - 7.
                                 La resta es sensible al orden, lo que significa que agrupar 
                                 los n&uacute;meros de manera diferente produce resultados distintos.</p>
                              <h3><span>3</span>Propiedad Conmutativa:</h3>
                              <p class="justificado">En contraste con la propiedad conmutativa presente
                                 en la suma, la resta carece de esta propiedad. Esto implica que el orden 
                                 de los n&uacute;meros en una operaci&oacute;n de resta es cr&iacute;tico. Por ejemplo, 7 - 3
                                  no es equivalente a 3 - 7. Esta caracter&iacute;stica resalta la importancia
                                   de considerar cuidadosamente el orden de los n&uacute;meros en las operaciones de resta.</p>
                                 <h3><span>4</span>Propiedad Asosiativa:</h3>
                              <p class="justificado">La suma es asociativa, lo que significa que cuando se suman tres o m&aacute;s
                                 n&uacute;meros, el resultado es el mismo sin importar c&oacute;mo se agrupen
                                  los sumandos. Por ejemplo, (1 + 2) + 3 es igual a 1 + (2 + 3), y ambos dan como resultado 6.</p>
                        </div>
                </section>
                </article>
                <article>
                    <main>
                        <section class="clientes contenedor">
                            <h2 class="titulo">Juego de resta</h2>
                            <div class="contenedor-juego">
                                <div class="juego-resta">
                                    <div id="resta">15 - 7 =</div>
                                    <input id="respuestaInput" type="number" placeholder="Tu respuesta">
                                    <button id="checkAnswer" onclick="comprobarRespuesta()">Comprobar</button>
                                    <div id="resultado" data-resultado="8"></div>
                                    <button id="nextButton" onclick="cargarNuevaPregunta()">Siguiente</button>
                                    <div id="mensaje" style="display: none;"></div>
                                </div>
                            </div>
                        </section>
                    </main>
                </article>
                
                        <main>
                            <section class="contenedor sobre-nosotros">
                                <h2 class="titulo">La multiplicaci&oacute;n</h2>
                                <div class="contenedor-sobre-nosotros">
                                    <img src="img/img12.jpg" alt="" class="imagen-about-us">
                                    <div class="contenido-textos">
                                        <h3>Definici&oacute;n</h3>
                                        <p>La multiplicaci&oacute;n es como hacer sumas de una manera 
                                            especial y r&aacute;pida. Imagina que tienes 3 bolsas, y 
                                            cada bolsa tiene 4 caramelos. Si quieres saber cu&aacute;ntos 
                                            caramelos tienes en total, podrías sumar 4 + 4 + 4, 
                                            lo que te daría 12. Pero, la multiplicaci&oacute;n es como 
                                            una varita m&aacute;gica que te permite encontrar la respuesta 
                                            m&aacute;s r&aacute;pido. En lugar de sumar una y otra vez, puedes decir 
                                            3 x 4, que tambi&eacute;n es igual a 12. La multiplicaci&oacute;n es 
                                            como una forma de sumar de manera r&aacute;pida cuando tienes 
                                            grupos iguales de cosas. Es muy &uacute;til para contar cosas 
                                            grandes y te ayudar&aacute; en la escuela y en la vida. ¡As&iacute; 
                                            que la multiplicaci&oacute;n es como una s&uacute;per herramienta matem&aacute;ticas.
                                            A continuaci&oacute;n, est&aacute;n los conceptos clave relacionados con la multiplicaci&oacute;n: </p>                                       
                                    </div>
                                </div>
                            </section>
                        </article>
                   <article>
                   <section class="contenedor sobre-nosotros">
                    <div class="contenedor-textos">
                   <h3><span>1</span>Factores y Producto:</h3>
                  <p class="justificado">Los n&uacute;meros que se multiplican se llaman "factores", 
                    y el resultado de la multiplicaci&oacute;n se llama "producto". Por ejemplo, 
                    en la multiplicaci&oacute;n 4 x 3, 4 y 3 son los factores, y el producto es 12, 
                    ya que 12 es el resultado de la multiplicaci&oacute;n</p>
                <h3><span>2</span>Propiedad Conmutativa: </h3>
                <p class="justificado">La multiplicaci&oacute;n es conmutativa, lo que significa que el orden 
                    de los factores no afecta el producto. En otras palabras, 4 x 3 es igual a 3 x 4,
                     y ambos dan como resultado 12.</p>
                <h3><span>3</span>Propiedad Asociativa:</h3>
              <p class="justificado">La multiplicaci&oacute;n es asociativa, lo que significa que 
                cuando se multiplican tres o m&aacute;s n&uacute;meros, el resultado es el mismo sin importar
                 c&oacute;mo se agrupen los factores. Por ejemplo, (2 x 3) x 4 es igual a 2 x (3 x 4), 
                 y ambos dan como resultado 24.</p>
            <h3><span>4</span>Identidad de la Multiplicación:</h3>
             <p class="justificado">El n&uacute;mero 1 act&uacute;a como elemento identidad en la 
                multiplicaci&oacute;n. Esto significa que multiplicar cualquier n&uacute;mero por
                 1 no cambia su valor. Por ejemplo, 5 x 1 es igual a 5.</p>
           </div>
           <article>
            <main>
                <section class="clientes contenedor">
                    <h2 class="titulo">Juego de Multiplicación</h2>
                    <div class="contenedor-juego">
                        <div class="juego-multiplicacion">
                            <div class="juego-multiplicacion">
                                <div id="pregunta-multiplicacion">6 x 4 =</div>
                                <input id="respuestaInput-multiplicacion" type="number" placeholder="Tu respuesta">
                                <button id="checkAnswer-multiplicacion" onclick="comprobarRespuestaMultiplicacion()">Comprobar</button>
                                <div id="resultado-multiplicacion" data-resultado="24"></div>
                                <button id="nextButton-multiplicacion" onclick="cargarNuevaPreguntaMultiplicacion()">Siguiente pregunta</button>
                                <div id="mensaje-multiplicacion"></div>
                                <div id="mensaje-multiplicacion-incorrecto"></div>
                            </div>
                </section>
            </main>
        </article>
         </section>
                    </article>
                    <article>
                        <main>
                            <section class="contenedor sobre-nosotros">
                                <h2 class="titulo">Divisi&oacute;n: Partici&oacute;n Equitativa</h2>
                                <div class="contenedor-sobre-nosotros">
                                    <img src="img/img13.jpg" alt="" class="imagen-about-us">
                                    <div class="contenido-textos">
                                        <h3>Definici&oacute;n</h3>
                                        <p>
                                            La divisi&oacute;n, una operaci&oacute;n fundamental en matem&aacute;ticas, 
                                            es como la magia de compartir cosas de manera justa.
                                             Imagina que tienes 12 caramelos y quieres compartirlos 
                                             con 3 amigos de manera equitativa. La división te ayuda 
                                             a hacerlo. Dividir 12 entre 3 significa que cada amigo 
                                             recibe 4 caramelos, ¡ninguno se queda con m&aacute;s ni con menos!
                                              Adem&aacute;s, la divisi&oacute;n te permite descubrir cu&aacute;ntas veces un
                                               nmero encaja perfectamente en otro. Por ejemplo, si tienes 
                                               15 caramelos y quieres repartirlos en grupos de 3, la
                                                divisi&oacute;n te dice que puedes hacerlo 5 veces, con 0
                                                 caramelos sobrantes. La divisi&oacute;n es esencial para 
                                                 resolver problemas de repartici&oacute;n, compartir y para entender 
                                                 cu&aacute;ntas partes iguales hay en una cantidad. Te ayudar&aacute; a 
                                                 tomar decisiones justas y a entender c&oacute;mo las cosas se
                                                  dividen equitativamente en la vida cotidiana y en la escuela.</p>                                          
                                    </div>
                                </div>
                            </section>
                        </article>
                   <article>
                   <section class="contenedor sobre-nosotros">
                    <div class="contenedor-textos">
                   <h3><span>1</span>Dividendo, Divisor y Cociente:</h3>
                  <p class="justificado">En una operaci&oacute;n de divisi&oacute;n, el n&uacute;mero que se 
                    divide se llama "dividendo", el n&uacute;mero por el cual se divide se llama 
                    "divisor" y el resultado se llama "cociente". Por ejemplo, en la divisi&oacute;n 
                    12 ÷ 3, 12 es el dividendo, 3 es el divisor y el cociente es 4.

                  </p>
                <h3><span>2</span>Propiedad de la División:</h3>
                <p class="justificado">La propiedad de la divisi&oacute;n es importante en matem&aacute;ticas.
                     A diferencia de la suma y la multiplicaci&oacute;n, la divisi&oacute;n no es conmutativa
                      ni asociativa. Esto significa que el orden en el que dividimos los n&uacute;meros
                       es crucial. Por ejemplo, 12 ÷ 3 no es igual a 3 ÷ 12. Debemos recordar que 
                       la divisi&oacute;n no sigue las mismas reglas que otras operaciones matem&aacute;ticas.</p>
                <h3><span>3</span>Dividir en partes iguales: </h3>
                    La divisi&oacute;n es como repartir algo de manera justa.
                     Supongamos que tienes 16 galletas y quieres compartirlas
                      entre 4 amigos. La divisi&oacute;n te dir&aacute; que cada amigo recibir&aacute; 
                      4 galletas. Es una forma de asegurarse de que todos tengan la 
                      misma cantidad, evitando que alguien tenga m&aacute;s o menos.
                       La divisi&oacute;n es como ser un buen amigo y compartir equitativamente.</p>
           </div>
           </section>
           <article>
            <main>
                <section class="clientes contenedor">
                    <h2 class="titulo">Juego de División</h2>
                    <div class="contenedor-juego">
                        <div class="juego-division">
                            <div id="question-division">36 ÷ 6 =</div>
                            <input id="userAnswer" type="number" placeholder="Tu respuesta">
                            <button id="checkAnswer" onclick="checkAnswer()">Comprobar</button>
                            <span id="resultMessage"></span>
                            <button id="nextButton" onclick="nextQuestion()">Siguiente</button>
                        </div>
                    </div>
                </section>
            </main>
        </article>
<footer>
    <div class="contenedor-footer">
        <div class="content-foo">
            <h4>Telefono</h4>
            <p>+57 3113023752</p>
        </div>
        <div class="content-foo">
            <h4>Gmail</h4>
            <p>sebastian.mahecha8a2020@jfkennedy.edu.co</p>
        </div>
        <div class="content-foo">
            <h4>Ubicaci&oacute;n</h4>
            <p>Puerto Boyac&aacute;, Boyac&aacute;, Colombia</p>
        </div>
    </div>
    <h2 class="titulo-final">&copy; MateWeb | Sebastian Mahecha</h2>
</footer>
</article>

<script src="css/js/Juegos.js"></script>
<script src="css/js/juego_resta.js"></script>
<script src="css/js/juego_multiplicacion.js"></script>
<script src="css/js/juego_division.js"></script>
</body>

</html>